docs/hoverfly/bsf_responses/current_saving/transactions/resGeneralInquiriesTransactions_AccountNumber_30200900142.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsf="http://BSF.EStatement/" xmlns:bsf1="http://BSF.EStatement.GetAccountStatement.GetAcctStatementRq">
   <soapenv:Header/>
   <soapenv:Body>
      <bsf:GetAcctStatementXml>
         <!--Optional:-->
         <bsf1:AcctStatementRq>
            <!--Optional:-->
            <AccountNumber>30200900142</AccountNumber>
            <FromDate>2020-01-01</FromDate>
            <ToDate>2023-01-01</ToDate>
            <!--Optional:-->
            <SourceSystem>OBA</SourceSystem>
         </bsf1:AcctStatementRq>
      </bsf:GetAcctStatementXml>
   </soapenv:Body>
</soapenv:Envelope>